
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/NaokiYazawa/bined-infra/actions/runs/5707049999)



<pre><code>Apply complete! Resources: 6 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.alb.data.aws_elb_service_account.main: Reading...
module.network.aws_vpc.this[0]: Refreshing state... [id=vpc-0a20ed93f94539036]
module.db.module.db_instance.data.aws_partition.current: Reading...
module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=bined-hasura-20230730144634945400000001]
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.alb.data.aws_elb_service_account.main: Read complete after 0s [id=582318560864]
module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.network.aws_default_network_acl.this[0]: Refreshing state... [id=acl-02f2e05642c4a4f10]
module.network.aws_subnet.public[0]: Refreshing state... [id=subnet-06e4b653ba82a0dbb]
module.network.aws_subnet.database[0]: Refreshing state... [id=subnet-06e0f4cbee44e1b7e]
module.network.aws_subnet.public[1]: Refreshing state... [id=subnet-0824e210311fe3361]
module.network.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04d47fac8f245bf03]
module.network.aws_default_route_table.default[0]: Refreshing state... [id=rtb-05c8ef1ecd42c0a1c]
module.network.aws_default_security_group.this[0]: Refreshing state... [id=sg-0e49e03a5db24049b]
module.network.aws_subnet.database[1]: Refreshing state... [id=subnet-012d2f4ea363148d7]
module.security_groups.aws_security_group.bastion: Refreshing state... [id=sg-0f8380f49f5c0ad42]
module.security_groups.aws_security_group.alb: Refreshing state... [id=sg-0ecb9e4d622873720]
module.security_groups.aws_security_group.ecs: Refreshing state... [id=sg-0ff51e5c4d89f1d35]
module.security_groups.aws_security_group.rds: Refreshing state... [id=sg-083bcb1f25b19e7ec]
module.network.aws_route_table.private[0]: Refreshing state... [id=rtb-0bb4120b65c92a107]
module.network.aws_route_table.public[0]: Refreshing state... [id=rtb-0100ed7567dfa4692]
module.network.aws_subnet.private[1]: Refreshing state... [id=subnet-04e257e755c87b631]
module.network.aws_subnet.private[0]: Refreshing state... [id=subnet-0f0bc25f4fe692b9f]
module.network.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0dc75306fafe9d656]
module.network.aws_db_subnet_group.database[0]: Refreshing state... [id=bined-hasura]
module.security_groups.aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-2400929530]
module.network.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-02aab784abc51b12a]
module.network.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0c5f41ee2056851dc]
module.network.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0970af91d0fee328c]
module.network.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ff62e3874f25450b]
module.network.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0100ed7567dfa46921080289494]
module.security_groups.aws_security_group_rule.rds_from_ecs: Refreshing state... [id=sgrule-3456404465]
module.security_groups.aws_security_group_rule.rds_from_bastion: Refreshing state... [id=sgrule-2433012620]
module.network.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-09c3069fee8860280]
module.network.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0e5ff3a153cc05fb7]
module.network.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0dc82545eb07c4ac9]
module.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-XXIT2TPBBUOXASROCVIPQMOYO4]
module.network.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0bb4120b65c92a1071080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.alb.data.aws_iam_policy_document.alb_log will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "alb_log" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::582318560864:root",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.alb.aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "bined-hasura"
      + preserve_host_header                        = false
      + security_groups                             = [
          + "sg-0ecb9e4d622873720",
        ]
      + subnets                                     = [
          + "subnet-06e4b653ba82a0dbb",
          + "subnet-0824e210311fe3361",
        ]
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)

      + access_logs {
          + bucket  = (known after apply)
          + enabled = true
          + prefix  = "alb"
        }
    }

  # module.alb.aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }
    }

  # module.alb.aws_lb_target_group.main will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "bined-hasura-alb-target-group"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0a20ed93f94539036"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 30
          + matcher             = "200"
          + path                = "/healthz"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }
    }

  # module.alb.aws_s3_bucket.alb_log will be created
  + resource "aws_s3_bucket" "alb_log" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "bined-hasura-alb-log-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.alb.aws_s3_bucket_lifecycle_configuration.alb_log will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "alb_log" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + id     = (known after apply)
          + status = "Enabled"

          + expiration {
              + days                         = 365
              + expired_object_delete_marker = (known after apply)
            }

          + filter {
              + prefix = "logs/"
            }
        }
    }

  # module.alb.aws_s3_bucket_policy.alb_log will be created
  + resource "aws_s3_bucket_policy" "alb_log" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.
module.alb.aws_s3_bucket.alb_log: Creating...
module.alb.aws_s3_bucket.alb_log: Creation complete after 5s [id=bined-hasura-alb-log-bucket]
module.alb.data.aws_iam_policy_document.alb_log: Reading...
module.alb.aws_s3_bucket_lifecycle_configuration.alb_log: Creating...
module.alb.data.aws_iam_policy_document.alb_log: Read complete after 0s [id=1370340032]
module.alb.aws_lb.main: Creating...
module.alb.aws_s3_bucket_policy.alb_log: Creating...
module.alb.aws_s3_bucket_policy.alb_log: Creation complete after 1s [id=bined-hasura-alb-log-bucket]
module.alb.aws_s3_bucket_lifecycle_configuration.alb_log: Still creating... [10s elapsed]
module.alb.aws_lb.main: Still creating... [10s elapsed]
module.alb.aws_s3_bucket_lifecycle_configuration.alb_log: Still creating... [20s elapsed]
module.alb.aws_lb.main: Still creating... [20s elapsed]
module.alb.aws_s3_bucket_lifecycle_configuration.alb_log: Still creating... [30s elapsed]
module.alb.aws_lb.main: Still creating... [30s elapsed]
module.alb.aws_s3_bucket_lifecycle_configuration.alb_log: Creation complete after 40s [id=bined-hasura-alb-log-bucket]
module.alb.aws_lb.main: Still creating... [40s elapsed]
module.alb.aws_lb.main: Still creating... [50s elapsed]
module.alb.aws_lb.main: Still creating... [1m0s elapsed]
module.alb.aws_lb.main: Still creating... [1m10s elapsed]
module.alb.aws_lb.main: Still creating... [1m20s elapsed]
module.alb.aws_lb.main: Still creating... [1m30s elapsed]
module.alb.aws_lb.main: Still creating... [1m40s elapsed]
module.alb.aws_lb.main: Still creating... [1m50s elapsed]
module.alb.aws_lb.main: Still creating... [2m0s elapsed]
module.alb.aws_lb.main: Creation complete after 2m4s [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:loadbalancer/app/bined-hasura/a741a29df068794d]
module.alb.aws_lb_listener.alb_listener: Creating...
module.alb.aws_lb_target_group.main: Creating...
module.alb.aws_lb_listener.alb_listener: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:listener/app/bined-hasura/a741a29df068794d/1648e0df2c74c4a2]
module.alb.aws_lb_target_group.main: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:targetgroup/bined-hasura-alb-target-group/dd6db5e43b282fe2]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 6 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":10,"Program":"tfcmt","SHA1":"58869397b19c49b8412967ab9dfb7e2abfc3e7d3","Vars":{},"WorkflowName":"Terraform"} -->